app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments"   ORDER BY created_at DESC
---
  def new
    @comment = Comment.new
    @comments = Comment.order('created_at DESC')

INSERT INTO "comments" ("body", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "hello"], ["created_at", "2015-03-25 09:31:39.803442"], ["updated_at", "2015-03-25 09:31:39.803442"], ["user_id", 1]]
---
  def create
    if current_user
      @comment = current_user.comments.build(comment_params)
      @comment.save